#include <stdio.h>
#include <sys/ipc.h>
#include <sys/msg.h>
#include <stdlib.h>
#include <string.h>

/*
Создать очередь сообщений или получить доступ к уже существующей очереди. 
Вывести на экран статистическую информацию об очереди сообщений. 
Поместить несколько сообщений различных типов в очередь.
*/

int q1()
{
    printf("=== question 1 start ===\n\n");
    
    //if ()

    printf("\n==== question 1 end ====\n");

    return 0;
}