#include <stdio.h>
#include <signal.h>

/*
Написать программу, иллюстрирующую способ блокирования дополнительных сигналов на время работы обработчика сигнала. 
Что произойдет, если во время обработки некоторого сигнала в процесс поступит несколько однотипных заблокированных сигналов.
*/

int q10()
{
    printf("=== question 10 start ===\n\n");

    

    printf("\n==== question 10 end ====\n");

    return 0;
}
