#include <stdio.h>
#include <signal.h>

/*
Написать программу, позволяющую использовать sigaction для реализации примера синхронизации процессов. 
Выполнить эту программу и объяснить ее поведение. Использовать sigsuspend и sigprocmask.
*/

int q11()
{
    printf("=== question 11 start ===\n\n");



    printf("\n==== question 11 end ====\n");

    return 0;
}
